//
//  main.m
//  practiceARM
//
//  Created by 陳永展 on 2020/4/17.
//  Copyright © 2020 allen. All rights reserved.
//

#import <UIKit/UIKit.h>
#import "AppDelegate.h"
#import "Person.h"

/*---------------------------------全局變量+函數參數-----------------------------------
int g = 16;
int func(int a,int b)
{
//  00000001000062b4         sub        sp, sp, #0x20                               ; CODE XREF=_main+28
//  00000001000062b8         stp        x29, x30, [sp, #0x10]
//  00000001000062bc         add        x29, sp, #0x10
//  00000001000062c0         stur       w0, [x29, #-0x4]
//  00000001000062c4         str        w1, [sp, #0x8]
//  00000001000062c8         adrp       x0, #0x100007000                            ; argument #1 for method imp___stubs__printf
//  00000001000062cc         add        x0, x0, #0xf86                              ; "Hello World"
//  00000001000062d0         bl         imp___stubs__printf
printf("Hello World");
//  00000001000062d4         adrp       x30, #0x10000d000
//  00000001000062d8         add        x30, x30, #0x530                            ; _g
int *x30 = &g;
//  00000001000062dc         ldur       w1, [x29, #-0x4]
int w1 = a;
//  00000001000062e0         ldr        w8, [sp, #0x8]
int w8 = b;
//  00000001000062e4         add        w8, w1, w8
w8 = w1 + w8;
//  00000001000062e8         ldr        w1, x30
w1 = *x30;
//  00000001000062ec         add        w8, w8, w1
w8 = w8 + w1;
//  00000001000062f0         str        w8, [sp, #0x4]
//  00000001000062f4         ldr        w8, [sp, #0x4]
//  00000001000062f8         str        w0, sp
//  00000001000062fc         mov        x0, x8
 return w8;
//  0000000100006300         ldp        x29, x30, [sp, #0x10]
//  0000000100006304         add        sp, sp, #0x20
//  0000000100006308         ret

//        printf("Hello World");
//        int c = a + b + g;
//        return c;

}
---------------------------------全局變量+函數參數-----------------------------------*/



//
// int g = 16;
// int func(int a,int b)
//{
// printf("Hello World");
// int c = a + b + g;
//  return c;
// }



/*---------------------------------if判斷式-----------------------------------
int g = 12;
void func(int a,int b){
//00000001000062e8         sub        sp, sp, #0x10                               ; CODE XREF=_main+28
//00000001000062ec         str        w0, [sp, #0xc]
//00000001000062f0         str        w1, [sp, #0x8]
//00000001000062f4         ldr        w0, [sp, #0xc]
//00000001000062f8         ldr        w1, [sp, #0x8]
//00000001000062fc         cmp        w0, w1
if(a <= b){
//0000000100006300         b.gt       loc_100006318
//
//0000000100006304         adrp       x8, #0x10000d000
//0000000100006308         add        x8, x8, #0x528                              ; _g
//000000010000630c         ldr        w9, [sp, #0xc]
//0000000100006310         str        w9, x8
a = g;
//0000000100006314         b          loc_100006328
//
//                     loc_100006318:
//0000000100006318         adrp       x8, #0x10000d000                            ; CODE XREF=_func+24
//000000010000631c         add        x8, x8, #0x528                              ; _g
//0000000100006320         ldr        w9, [sp, #0x8]
//0000000100006324         str        w9, x8
//
}else{
b = g;
}
//                     loc_100006328:
//0000000100006328         add        sp, sp, #0x10                               ; CODE XREF=_func+44
//000000010000632c         ret

return;
}
//int g = 12 ;
//
//void func(int a,int b){
//    if(a <= b){
//        g = a ;
//    }else{
//        g = b ;
//    }
//    return;
//}
---------------------------------if判斷式-----------------------------------*/

//---------------------------------switch-----------------------------------

//void funcA(int a){
    
    //0000000100006238         sub        sp, sp, #0x50                               ; CODE XREF=_main+24
    //000000010000623c         stp        x29, x30, [sp, #0x40]
    //0000000100006240         add        x29, sp, #0x40
    //0000000100006244         stur       w0, [x29, #-0x4]
    //0000000100006248         ldur       w0, [x29, #-0x4]

    //000000010000624c         subs       w0, w0, #0x1
//    a -= 1;
    
    //0000000100006250         mov        x8, x0
    
    //0000000100006254         subs       w0, w0, #0x3
//    a -= 3;
    
    //0000000100006258         stur       x8, [x29, #-0x10]
    //x8 =  a-1;
    //000000010000625c         stur       w0, [x29, #-0x14]
    //x0 =  a-4;
    
    
    
    //0000000100006260         b.hi       loc_1000062d0
    //
    //0000000100006264         adrp       x8, #0x100006000
    //0000000100006268         add        x8, x8, #0x2ec                              ; 0x1000062ec
    
    //0x1000062ec地址
    
    //000000010000626c         ldur       x11, [x29, #-0x10]
    //0000000100006270         ldrsw      x10, [x8, x11, lsl #2]
    //0000000100006274         add        x9, x8, x10
    //0000000100006278         str        x10, [sp, #0x20]
    //000000010000627c         br         x9
    //                        ; endp
    
    
    //0000000100006280         adrp       x0, #0x100007000
    //0000000100006284         add        x0, x0, #0xf6a
    //0000000100006288         bl         imp___stubs__printf
    //000000010000628c         str        w0, [sp, #0x1c]
    //0000000100006290         b          _funcA+168
    //0000000100006294         adrp       x0, #0x100007000
    //0000000100006298         add        x0, x0, #0xf71
    //000000010000629c         bl         imp___stubs__print f
    //00000001000062a0         str        w0, [sp, #0x18]
    //00000001000062a4         b          _funcA+168
    //00000001000062a8         adrp       x0, #0x100007000
    //00000001000062ac         add        x0, x0, #0xf78
    //00000001000062b0         bl         imp___stubs__printf
    //00000001000062b4         str        w0, [sp, #0x14]
    //00000001000062b8         b          _funcA+168
    //00000001000062bc         adrp       x0, #0x100007000
    //00000001000062c0         add        x0, x0, #0xf82
    //00000001000062c4         bl         imp___stubs__printf
    //00000001000062c8         str        w0, [sp, #0x10]
    //00000001000062cc         b          _funcA+168
    //
    
    
    
    //                     loc_1000062d0:
    //00000001000062d0         adrp       x0, #0x100007000                            ; argument #1 for method imp___stubs__printf, CODE XREF=_funcA+40
    //00000001000062d4         add        x0, x0, #0xf89                              ; "\\xE6\\x94\\xBE\\xE7\\xA9\\xBA"
    //00000001000062d8         bl         imp___stubs__printf
    //00000001000062dc         str        w0, [sp, #0xc]
    //00000001000062e0         ldp        x29, x30, [sp, #0x40]                       ; CODE XREF=_funcA+88, _funcA+108, _funcA+128, _funcA+148
    //00000001000062e4         add        sp, sp, #0x50
    //00000001000062e8         ret
    //                        ; endp
    //00000001000062ec         db  0x94 ; '.'                                         ; DATA XREF=_funcA+48
    //00000001000062ed         db  0xff ; '.'
    //00000001000062ee         db  0xff ; '.'
    //00000001000062ef         db  0xff ; '.'
    //00000001000062f0         db  0xa8 ; '.'
    //00000001000062f1         db  0xff ; '.'
    //00000001000062f2         db  0xff ; '.'
    //00000001000062f3         db  0xff ; '.'
    //00000001000062f4         db  0xbc ; '.'
    //00000001000062f5         db  0xff ; '.'
    //00000001000062f6         db  0xff ; '.'
    //00000001000062f7         db  0xff ; '.'
    //00000001000062f8         db  0xd0 ; '.'
    //00000001000062f9         db  0xff ; '.'
    //00000001000062fa         db  0xff ; '.'
    //00000001000062fb         db  0xff ; '.'

        
        
        
    //    void funcA(int a){
    //        switch (a) {
    //            case 1:
    //                printf("吃飯");
    //                break;
    //            case 2:
    //                printf("睡覺");
    //                break;
    //            case 3:
    //                printf("打電動");
    //                break;
    //            case 4:
    //                printf("運動");
    //                break;
    //            default:
    //                printf("放空");
    //                break;
    //        }
    //    }
    
//}





//---------------------------------switch-----------------------------------

//--------------------------------指針----------------------------------
// _func:
//0000000100006250         sub        sp, sp, #0x20                               ; CODE XREF=_main+20
//0000000100006254         ldr        x8, [sp, #0x18]
//0000000100006258         ldr        x8, x8
//000000010000625c         str        x8, [sp, #0x10]
//0000000100006260         ldr        x8, [sp, #0x18]
//0000000100006264         ldr        x8, [x8, #0x8]
//0000000100006268         str        x8, [sp, #0x8]
//000000010000626c         add        sp, sp, #0x20
//0000000100006270         ret



//void func(){
//
//    int  ** p1;
//    int * c = *p1;
//    int * d = *(p1 + 1);
//}

//--------------------------------指針----------------------------------

int main(int argc, char * argv[]) {
//    func(10, 15);
//        Person * p = [[Person alloc] init];
//        p.name = @"Allen";
//        p.age = 18;
//    func();
}
